Материал для изучения: https://metanit.com/php/tutorial/2.8.php

Задача 1:

С помощью вложенных циклов вывести на экран таблицу умножения.

Задача 2:

Даны размеры прямоугольника a и b. Вывести на экран прямоугольник, состоящий из символов Х

пример: а=4 в=3

ХХХХ

ХХХХ

ХХХХ

Задача 3:

Реализовать задачу1 в виде именно HTML таблицы, ИСПОЛЬЗУЯ теги <table> <tr> <td>. Размеры ячеек должны быть равными и у них должны быть границы.

Задача 4:

Вывести в виде HTML таблицу квадратов двузначных чисел

Задача 5:

Вывести на экран «прямоугольник», образованный из двух видов символов. Контур прямоугольника должен состоять из одного символа, а в «заливка» — из другого. Даны размеры прямоугольника а и в.

Задача 6:

Найти все делители натурального числа п.

Дополнительно:

Задача 7:

Найти произведение цифр заданного к-значного числа.