<h1>Материал для изучения: https://metanit.com/php/tutorial/2.7.php</h1>

<h2>Решить задачи с использованием тернарного оператора (if использовать нельзя).</h2>

<h2>Задача 1: </h2>
<p>Ввести с клавиатуры два числа a и b. Если a < b вывести на экран сумму a+b, иначе вывести на экран произведение a*b </p>

<h2>Задача 2:</h2>
 <p>Дано число n. Выведите "чётное", если оно делится на 2 без остатка, иначе — "нечётное".</p>

<h2>Задача 3:</h2>
 <p>Дана сумма покупки sum. Если сумма больше 1000, скидка 10%, иначе — 5%. Вычислите итоговую стоимость.</p>

<h2>Задача 4: </h2>
<p>Даны три стороны треугольника a, b, с (ввести с клавиатуры). Вывести на экран сообщение о том, существует ли такой треульник.</p>

<h2>Задача 5:</h2>
 <p>Напиши программу, которая будет определять возрастную группу котов по возрасту.
Возраст записан в переменную age.
Проверяй возраст и записывай возрастную группу в виде строки в переменную ageGroup.
Если возраст до года включительно, то возрастная группа называется 'Котята'.
Если возраст от года (не включая это значение) до трёх лет включительно — 'Молодые коты'.
Если возраст от трёх лет (не включая это значение) до семи (включительно) — 'Коты средних лет'.
А если возраст от семи лет (не включая это значение) и больше — 'Почтенные коты'.</p>

<h2>Задача 6:</h2>
<p> Даны два угла треугольника (в градусах). Определить, существует ли такой треугольник, и если да, то будет ли он прямоугольным.</p>

