<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
    Материал для изучения: https://metanit.com/php/tutorial/2.8.php

<h2>Задача 1:</h2>

<p>С помощью вложенных циклов вывести на экран таблицу умножения.</p>

<h2>
Задача 2:
</h2>

<p>Даны размеры прямоугольника a и b. Вывести на экран прямоугольник, состоящий из символов Х

пример: а=4 в=3

ХХХХ

ХХХХ

ХХХХ</p>

<h2>Задача 3:</h2>

<p>Реализовать задачу1 в виде именно HTML таблицы, ИСПОЛЬЗУЯ теги <table> <tr> <td>. Размеры ячеек должны быть равными и у них должны быть границы.</p>

<h2>Задача 4:</h2>

<p>Вывести в виде HTML таблицу квадратов двузначных чисел</p>

<h2>Задача 5:</h2>

<p>Вывести на экран «прямоугольник», образованный из двух видов символов. Контур прямоугольника должен состоять из одного символа, а в «заливка» — из другого. Даны размеры прямоугольника а и в.</p>

<h2>Задача 6:</h2>

<p>Найти все делители натурального числа п.

Дополнительно:
</p>
<h2>Задача 7</h2>

<p>Найти произведение цифр заданного к-значного числа.</p>
</body>
</html>