Задание 1
Дан неупорядоченный массив целых чисел. 
Найти максимальный и минимальный элемент массива. 
Вывести их номера(индексы) и значения.

Задание 2
Дан массив целых чисел. Найти сумму и произведение его элементов. 
Вывести на экран.

Задание 3
Дан массив целых чисел. Найти среднее арифметическое его элементов. 
Вывести на экран.

Задание 4
Преобразовать массив вещественных чисел по правилу: положительные элементы заменить их квадратами,  отрицательные - абсолютными величинами. Для этого создайте еще один массив.
Вывести на экран исходный и получившийся массивы.

Задание 5
Дан массив, состоящий из целых чисел. Нумерация элементов начинается с 0. Напишите программу, которая выведет элементы массива, номера которых четны (0, 2, 4...).

Задание 6
Дан массив чисел. Выведите все элементы массива, которые больше предыдущего элемента.

Задание 7
Переставьте соседние элементы массива (A[0] c A[1], A[2] c A[3] и т.д.). Если элементов нечетное число, то последний элемент остается на своем месте.


Дополнительно:

Задание 8
Циклически сдвиньте элементы списка вправо (A[0] переходит на место A[1], A[1] на место A[2], ..., последний элемент переходит на место A[0]).

Задание 9
Дан массив чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.